{
  "personal": {
    "name": {
      "full": "Abiezer Reyes",
      "display": "Abiezer \"Abe\" Reyes",
      "first": "Abe",
      "last": "Reyes"
    },
    "title": "Full-Stack Developer",
    "location": {
      "city": "Orlando",
      "state": "FL",
      "zip": "32839",
      "display": "Orlando, FL"
    },
    "contact": {
      "email": "abe.raise@gmail.com",
      "phone": "407-873-6713",
      "website": "https://needthisdone.com",
      "github": "https://github.com/AbeJitsu",
      "linkedin": "https://www.linkedin.com/in/weneedthisdone"
    }
  },

  "bios": {
    "headline": {
      "content": "Full-stack developer building with React, Next.js, and AI/RAG systems. Army medic discipline + 7 years in automotive finance taught me to solve problems under pressure and deliver results.",
      "charLimit": 220,
      "use": "LinkedIn headline, Twitter bio"
    },
    "short": {
      "content": "Full-stack developer who spent 5 years as an Army paramedic and 7 years climbing Toyota's ranks. Now I build software with the same intensity I brought to keeping people alive.",
      "charLimit": 500,
      "use": "Conference bios, brief introductions"
    },
    "medium": {
      "content": "Former Army paramedic → Toyota Finance Manager → Full-stack developer. I bring the same discipline that kept patients alive and earned promotions to building software that works. I build production applications with React, Next.js, and AI/RAG systems. My background means I understand both the engineering and the \"why does this matter.\"",
      "charLimit": 1000,
      "use": "Speaker bios, portfolio about"
    },
    "linkedin_about": {
      "content": "Full-stack developer who builds applications from the ground up, frontend to backend to deployment.\n\nI can take your idea from concept to live product. That means responsive interfaces in React and Next.js, APIs in Node.js, databases that scale, and infrastructure that doesn't break at 2am. When AI makes sense for your project, I build RAG systems with semantic search, vector databases, and responses grounded in your data.\n\nNeed data from somewhere it doesn't want to go? I build web scraping pipelines that collect, clean, and feed information into whatever system needs it. Need manual processes to disappear? I write automation that handles the repetitive work so your team can focus on what matters.\n\nWhat I bring beyond the technical:\n\nI ask the right questions before writing code. Years of high-pressure decision-making taught me that understanding the problem saves everyone time and money. I think about who's using what I build, not just whether it works, but whether it makes sense to them.\n\nI communicate clearly because I've spent years translating complex information for people who aren't technical. I document my work so the next person isn't guessing. I meet deadlines because I've worked in environments where missing them wasn't an option.\n\nIf you're looking for a developer who ships reliable software and is genuinely easy to work with, let's connect. I'd love to hear what you're building.",
      "charLimit": 2600,
      "use": "LinkedIn About section"
    }
  },

  "work_experience": [
    {
      "id": "needthisdone",
      "company": "needthisdone.com",
      "company_description": "Independent Consulting Practice",
      "title": "Full Stack Developer & Consultant",
      "employment_type": "Self-Employed",
      "location": "Orlando, FL",
      "location_type": "Remote",
      "dates": {
        "start": "2023-11",
        "end": null,
        "display": "November 2023 - Present"
      },
      "current": true,
      "client_engagements": [
        {
          "client": "Acadio",
          "client_description": "Educational LMS Platform",
          "role": "Technical Operations Specialist",
          "dates": {
            "start": "2025-04",
            "end": "2025-12",
            "display": "April 2025 - December 2025"
          },
          "bullets": [
            "Started as contractor doing API work; proved value and expanded responsibilities",
            "Became the person leadership came to with technical questions",
            "Built Python scripts to convert messy PDFs into clean HTML for learning platform",
            "Designed automated workflows eliminating manual processes",
            "Handled data migrations turning multi-day headaches into same-day completions"
          ],
          "technologies": ["Python", "Puppeteer", "BeautifulSoup", "TinyMCE"]
        }
      ],
      "descriptions": {
        "application_description": "Independent consulting practice building production software and solving technical problems for clients. Largest engagement was Acadio (EdTech), where I started as a contractor and expanded into technical operations. Also built my own e-commerce platform (needthisdone.com) and provided data transformation and automation services for business clients.",
        "resume_bullets": [
          "Built production e-commerce platform with AI chatbot, payment processing, and automated testing (needthisdone.com)",
          "Client: Acadio (EdTech) — Started as API contractor, proved value, expanded to technical operations over 9 months",
          "Built automated data extraction workflows using Python (BeautifulSoup, Selenium) to convert PDFs, Excel files, and web content into clean, structured formats. Scraped regulated content (FINRA rules) for RAG systems with validation and quality checks",
          "Ongoing client services: web development, data automation, and marketing analytics"
        ],
        "resume_summary": "E-commerce platform: Complete system with shopping flows, user authentication, order management, admin dashboard, and component-based page builder so non-technical users can create pages without code. Built with a layered architecture that handles traffic, business logic, and data separately, making the system faster and easier to maintain. Smart indexing ensures pages load quickly by only updating what's changed.",
        "linkedin": "Independent consulting practice focused on full-stack development, data transformation, and technical problem-solving.\n\nLargest Engagement: Acadio (EdTech)\nApril 2025 - December 2025\n\nStarted as a contractor doing API integration work. Proved value quickly and expanded into technical operations:\n\n• Designed web scraping infrastructure to collect FINRA rules and regulations for AI-powered study content\n• Built Python scripts to convert messy PDFs into clean HTML for the learning platform\n• Transformed unformatted Word docs and Excel files into structured formats\n• Became the person leadership came to with technical questions\n\nOwn Platform: needthisdone.com\n\nProfessional services marketplace with:\n• Next.js + Supabase + Redis architecture\n• AI chatbot using RAG (pgvector + OpenAI)\n• Stripe payment processing and appointment booking\n• Automated test suite with Playwright\n• WCAG AA accessibility compliance\n\nOngoing Services:\n• Data transformation and automation for business clients\n• Web development consulting\n• Technical problem-solving\n\nTech: Next.js 14, TypeScript, React, Python, Supabase, Redis, Medusa, Stripe, Docker, Playwright",
        "brief": "Independent consulting: E-commerce platform, EdTech client work, data automation"
      },
      "key_accomplishments": [
        "Production e-commerce platform (needthisdone.com)",
        "Acadio engagement: API work → Technical Operations (8 months)",
        "Data transformation pipelines (DOCX, XLSX, PDF to HTML)",
        "AI chatbot with RAG (Supabase pgvector + OpenAI)",
        "Automated test suite covering full user journey",
        "WCAG AA accessibility compliance"
      ],
      "technologies": ["Next.js 14", "TypeScript", "React", "Python", "Supabase", "Redis", "Medusa", "Stripe", "Docker", "Playwright", "Vitest", "TailwindCSS", "Puck", "OpenAI API", "Puppeteer", "BeautifulSoup"]
    },
    {
      "id": "toyota",
      "company": "Toyota of Orlando",
      "company_description": "Automotive Sales",
      "title": "Finance Manager",
      "title_progression": "Salesperson → Sales Manager → Finance Manager",
      "employment_type": "Full-time",
      "location": "Orlando, FL",
      "location_type": "On-site",
      "dates": {
        "start": "2017-03",
        "end": "2023-12",
        "display": "Spring 2017 - Winter 2023"
      },
      "current": false,
      "descriptions": {
        "resume_bullets": [
          "Earned three promotions over seven years at a high-volume dealership moving 10-30 cars daily",
          "Worked with 3-7 customers daily, walking them through their options and putting together financing across different lenders",
          "Built trust with customers by explaining options clearly. Became the go-to person when teammates had complicated deals"
        ],
        "application_description": "Seven years at a high-volume Toyota store where the team processed 10-30 deals daily. I earned three promotions by consistently delivering results, finishing as Finance Manager handling 3-7 customers per day. I know how to present protection products, structure deals across multiple lenders, and keep transactions compliant without slowing things down.\n\nCustomers left my office feeling good about their decisions because I explained options clearly instead of pushing products. Teammates brought me their complicated deals because I could find solutions. You're getting someone who performs under pressure, earns trust quickly, and makes the department run smoother.",
        "linkedin": "Seven years, three roles, one lesson: earn trust by showing up and solving problems.\n\nI started on the sales floor and worked my way to Finance Manager — not by chasing titles, but by consistently delivering for customers and teammates. Each promotion came from doing the current job well enough that the next one made sense.\n\nWhat I did:\n\n• Guided customers through one of the biggest financial decisions of their lives — listening first, explaining clearly, and helping them feel confident rather than pressured\n\n• Managed complex financial transactions, compliance requirements, and lending relationships while keeping the customer experience smooth\n\n• Built systems and processes that made the department run better — the same instinct I now bring to writing clean, maintainable code\n\n• Mentored teammates and became the person people came to when deals got complicated\n\nWhat I took with me:\n\nThe ability to translate complex information for people who aren't experts. Patience with problems that don't have obvious answers. A deep respect for the person on the other side of the table.\n\nThese skills didn't disappear when I switched careers — they're the foundation of how I build software today.",
        "brief": "7 years advancing from sales to finance leadership"
      },
      "key_accomplishments": [
        "Three promotions in 7 years at high-volume dealership (300-600+ units/month)",
        "3-7 F&I deals per day: VSC, GAP, maintenance plans, ancillary products",
        "Multi-lender deal structuring and compliance"
      ]
    },
    {
      "id": "fullsail_work",
      "company": "Full Sail University",
      "company_description": "Higher Education",
      "title": "Admissions Representative & Military Student Liaison",
      "title_alt": "Military Enrollment Counselor",
      "title_progression": "International Admissions Rep → Military Student Liaison",
      "employment_type": "Full-time",
      "location": "Winter Park, FL",
      "location_type": "On-site",
      "dates": {
        "start": "2012-01",
        "end": "2017-12",
        "display": "2012 - 2017"
      },
      "current": false,
      "descriptions": {
        "application_description": "Started working with international students, then moved to the Military department because my Army background gave me credibility with veterans navigating the transition to civilian life. Helped service members and their families understand GI Bill benefits, program costs, and how to make education work around military obligations. Same skill set I used in F&I: breaking down complex financial information so people can make confident decisions.",
        "resume_bullets": [
          "Started in International Admissions, then moved to Military Student Services where my Army background gave me credibility with veterans navigating civilian life",
          "Guided service members and families through GI Bill benefits, program costs, and fitting education around military schedules"
        ],
        "linkedin": "Started in the International department helping prospective students from around the world navigate the admissions process. These conversations required patience, cultural awareness, and the ability to explain complex US education systems to families making decisions from thousands of miles away.\n\nAfter proving I could connect with diverse audiences, moved to the Military department as a Student Liaison. This role felt personal — I'd served in the Army as a paramedic, so I understood what service members face when transitioning to civilian life.\n\nHelped veterans, active-duty personnel, and their families understand how to use their GI Bill benefits, navigate program requirements, and plan their education around military obligations. These weren't just enrollment conversations — they were career transition conversations.\n\nWhat I learned here shows up in my development work today: listening before talking, translating complex information into plain language, and understanding that behind every question is someone trying to make a better life for themselves.\n\nConsistently met enrollment goals while maintaining integrity. No high-pressure tactics — just honest guidance and genuine support.",
        "brief": "Guided students through educational decisions, specializing in international and military student support"
      }
    },
    {
      "id": "army",
      "company": "U.S. Army",
      "company_description": "Military Service",
      "title": "Paramedic",
      "title_alt": "Combat Medic",
      "rank": "Corporal (E-4)",
      "employment_type": "Full-time",
      "location": "Fort Hood, TX / Fort Bragg, NC",
      "location_type": "On-site",
      "dates": {
        "start": "1996-01",
        "end": "2001-03",
        "display": "1996 - 2001"
      },
      "current": false,
      "descriptions": {
        "application_description": "Five years as an Army combat medic, promoted to Corporal. Led a team of 3 medics and 2 combat lifesavers. Delivered emergency care where mistakes cost lives and hesitation wasn't an option. Learned to stay calm under pressure, follow protocols precisely, and take responsibility for my team's performance. That foundation shows up in everything I've done since.",
        "resume_bullets": [
          "Led a team of 3 medics and 2 combat lifesavers. Delivered emergency care where mistakes cost lives and hesitation wasn't an option",
          "Learned to stay calm under pressure, follow protocols precisely, and take responsibility for my team's performance"
        ],
        "linkedin": "Delivered emergency medical care under high-pressure conditions requiring rapid decision-making and problem-solving. Maintained critical systems and protocols where precision and attention to detail were essential. Developed discipline, systematic thinking, and attention to detail — core skills I now apply to software architecture and testing.",
        "brief": "5 years delivering emergency medical care in high-pressure environments"
      },
      "key_accomplishments": [
        "Emergency medical care in high-pressure conditions",
        "Rapid decision-making and problem-solving",
        "Precision and attention to detail"
      ]
    },
    {
      "id": "quill",
      "company": "Quill.com",
      "company_description": "Office Supplies (Staples)",
      "title": "B2B Sales Representative",
      "employment_type": "Full-time",
      "location": "Orlando, FL",
      "location_type": "On-site",
      "dates": {
        "start": "2009-01",
        "end": "2011-12",
        "display": "2009 - 2011"
      },
      "current": false,
      "descriptions": {
        "resume_bullets": [
          "Outbound sales in a high-volume call center, contacting buyers to open Quill.com business accounts",
          "Built relationships with business owners and office managers to establish ongoing purchasing accounts"
        ],
        "brief": "High-volume outbound B2B sales opening business accounts"
      }
    }
  ],

  "education": [
    {
      "id": "army_medical",
      "school": "U.S. Army Medical Department Center & School",
      "degree": "Certificate",
      "field": "Emergency Medical Care / Combat Medic",
      "dates": {
        "start": "1996-01",
        "end": "2001-03",
        "display": "1996 - 2001"
      },
      "grade": "Corporal (E-4)",
      "activities": "Recreational racquetball — spent my twenties bouncing off walls between shifts",
      "description": "Emergency medicine training under high-pressure conditions. Patient assessment, trauma care, critical decision-making, and systematic protocols."
    },
    {
      "id": "fullsail_student",
      "school": "Full Sail University",
      "degree": "Coursework in Web Design & Development",
      "field": "Web Design & Development",
      "dates": {
        "start": "2016-01",
        "end": "2017-06",
        "display": "Winter 2016 - Summer 2017"
      },
      "grade": "Straight A's",
      "completed": false,
      "activities": "Earned A's in every class while working full-time.",
      "description": "Web Design & Development coursework. After teaching myself web technologies since the early 2000s, this program provided the structure to take those skills to a professional level."
    },
    {
      "id": "independent_study",
      "school": "Independent Study",
      "degree": "Continuous Development",
      "field": "Web Development & Programming",
      "dates": {
        "start": "2016-01",
        "end": "2023-01",
        "display": "2016 - 2023"
      },
      "grade": "Ongoing",
      "completed": true,
      "activities": "Learned while working full-time at Toyota. Built small projects, followed tutorials, studied documentation.",
      "description": "Seven years of consistent skill development while working full-time. Progressed from tutorials to building production applications."
    },
    {
      "id": "khan_academy",
      "school": "Khan Academy",
      "degree": "Professional Development",
      "field": "Computer Science Foundations",
      "dates": {
        "start": "2023-01",
        "end": "2023-12",
        "display": "2023"
      },
      "grade": "100% Mastery",
      "activities": "Practicing Brazilian Jiu-Jitsu (blue belt) — a reminder that growth happens when you're willing to be a beginner again. Same mindset I brought to learning code.",
      "description": "AP Computer Science Principles — algorithms, data structures, programming, computer architecture, networking, Internet protocols, cybersecurity, encryption."
    },
    {
      "id": "udemy_100_days",
      "school": "Udemy",
      "degree": "Professional Development",
      "field": "100 Days of Code",
      "dates": {
        "start": "2023-01",
        "end": "2023-12",
        "display": "2023"
      },
      "grade": "Completed",
      "activities": "Daily coding practice building discipline and momentum. Blue belt in jiu-jitsu at the time — both journeys taught me that consistency beats intensity."
    },
    {
      "id": "udemy_vue",
      "school": "Udemy",
      "degree": "Professional Development",
      "field": "Vue - The Complete Guide (Maximilian Schwarzmüller)",
      "dates": {
        "start": "2023-01",
        "end": "2023-12",
        "display": "2023"
      },
      "grade": "Completed",
      "activities": "Deep dive into Vue.js — components, routing, state management, and the Composition API. Like drilling submissions, repetition made it stick."
    }
  ],

  "skills": {
    "frontend_ui": {
      "label": "Frontend & UI Systems",
      "items": ["React", "Next.js", "Vue.js", "TypeScript", "Tailwind", "Liquid (Shopify)", "Visual Page Builders (Puck)", "WYSIWYG Editors (TipTap)"]
    },
    "backend_data": {
      "label": "Backend & Data",
      "items": ["Node.js", "Python", "REST APIs", "GraphQL", "PostgreSQL", "MongoDB", "Supabase", "Medusa", "Redis", "Schema Design", "Zod"]
    },
    "testing_quality": {
      "label": "Testing & Quality",
      "items": ["Playwright E2E", "Vitest", "WCAG AA Accessibility", "Storybook", "CI/CD", "Git"]
    },
    "ai_automation": {
      "label": "AI & Automation",
      "items": ["LLM Integration (OpenAI, Claude)", "Prompt Engineering", "RAG Systems", "Chatbots", "Vector Embeddings", "Web Scraping (BeautifulSoup, Selenium)", "Data Extraction Workflows"]
    },
    "architecture": {
      "label": "Architecture",
      "items": ["Modular Components", "Custom Hooks", "Context Providers", "Optimistic Updates", "Cache-Aside Pattern", "Turborepo", "pnpm Workspaces"]
    },
    "design_process": {
      "label": "Design & Process",
      "items": ["Mobile-First", "Figma", "Component Libraries", "Test-Driven Development"]
    },
    "it_support": {
      "label": "IT & Technical Support",
      "items": [
        "TeamViewer",
        "Remote Desktop (RDP)",
        "Windows Administration",
        "Hardware Troubleshooting",
        "Software Installation & Configuration",
        "Network Diagnostics",
        "Technical Documentation"
      ],
      "context": "Years of solo development required self-sufficient troubleshooting across software, hardware, networking, and system administration"
    }
  },

  "projects": [
    {
      "id": "needthisdone",
      "name": "needthisdone.com",
      "role": "Full Stack Developer",
      "dates": {
        "start": "2023-11",
        "end": null,
        "display": "November 2023 - Present"
      },
      "featured": true,
      "url": "https://needthisdone.com",
      "github": "https://github.com/AbeJitsu/Need_This_Done",
      "description": "E-commerce platform with AI chatbot, appointment booking, and admin dashboards. Full test coverage.",
      "technologies": ["Next.js 14", "TypeScript", "Supabase", "Redis", "Medusa", "Puck", "Docker", "GitHub Actions", "Playwright", "Vitest"]
    },
    {
      "id": "flashcard_system",
      "name": "Flashcard Management System",
      "role": "Developer",
      "dates": {
        "start": "2025-01",
        "end": "2025-12",
        "display": "2025"
      },
      "featured": false,
      "description": "Python/HTML automation for managing flashcard content with Excel/XLSX processing, automated creation scripts, and systematic validation. Foundation for Acadio automation work.",
      "technologies": ["Python", "HTML", "Excel/XLSX processing"]
    },
    {
      "id": "merge_52",
      "name": "Merge 52",
      "role": "Developer",
      "dates": {
        "start": "2024-01",
        "end": "2024-12",
        "display": "2024"
      },
      "featured": false,
      "description": "JavaScript card game featuring organized code architecture, fair randomization algorithms, and an AI opponent that makes strategic decisions.",
      "technologies": ["JavaScript", "OOP", "Algorithms"]
    }
  ],

  "linkedin_posts": [
    {
      "id": "developer_intro",
      "title": "Developer Introduction",
      "created": "2025-12-16",
      "content": "You probably have a dozen technical problems that aren't getting solved because your team is stretched thin.\n\nI specialize in being the person who takes those problems off your plate.\n\n---\n\nHere's what I do well:\n\n• Build e-commerce platforms (checkout flows, payment processing, order management)\n\n• Automate manual workflows that waste your team's time\n\n• Integrate AI features that add value (RAG systems, semantic search, chatbots)\n\n• Write tests so bugs get caught before customers see them\n\n• Communicate in plain language, no jargon walls\n\n---\n\nRecent work:\n\nComplete e-commerce platform with AI chatbot, appointment booking, and admin dashboards.\n\nComprehensive test coverage with unit, integration, and E2E tests covering the full user journey.\n\n---\n\nWhat makes me different:\n\nMy background (Army paramedic to Toyota Finance Manager to Full-stack developer) means I understand both the technical work and the business reasons behind it.\n\nIf you're tired of developers who over-promise and under-deliver, let's talk. I'd rather show you what I've built than tell you what I can do."
    }
  ],

  "cover_letter_elements": {
    "key_accomplishments": {
      "acadio": [
        "Automated flashcard generation (weeks → minutes)",
        "Multi-phase validation pipelines with auto-correction",
        "Primary technical problem-solver on engineering team",
        "Content tools for SIE/Series-7 exam preparation",
        "Web scraping infrastructure for FINRA regulations"
      ],
      "needthisdone": [
        "Redis caching layer for fast page loads",
        "Automated test suite with Playwright",
        "WCAG AA accessibility compliance across all components",
        "Multi-environment Docker containerization",
        "Three-tier architecture with independent service scaling",
        "Context-aware chatbots using pgvector semantic search",
        "Professional git workflow (main/dev/experiment branches)",
        "GitHub Actions CI/CD pipeline"
      ],
      "previous_projects": [
        "Flashcard management system with automated creation and validation",
        "JavaScript solitaire game: OOP state management, algorithm implementation",
        "Full-stack client projects: Node.js, Express, database design",
        "Python automation: Excel/XLSX processing, data transformation"
      ]
    },
    "role_specific_intros": {
      "backend_architecture": "Through my independent consulting work, I demonstrated the problem-solving and architectural thinking your team needs. My largest client engagement was Acadio (EdTech), where I built an automated flashcard generation system that reduced manual content creation from weeks to minutes through thoughtful system design and modern tooling integration.",
      "fullstack_devops": "My experience building needthisdone.com demonstrates the full-stack and DevOps expertise your team is seeking. The architecture uses Next.js with Supabase and Redis for data and caching.",
      "frontend_design": "I have built responsive React and Vue.js applications demonstrating strong front-end fundamentals. In my work at needthisdone.com, I implemented WCAG AA accessibility compliance across all components and comprehensive E2E testing with Playwright.",
      "ai_integration": "I have successfully integrated modern AI tooling into production applications. During my Acadio client engagement, I used Claude Code to build systems that dramatically reduced manual work. On needthisdone.com, I implemented context-aware chatbots using Supabase pgvector semantic search and OpenAI embeddings, demonstrating practical understanding of RAG patterns and LLM integration.",
      "it_support_helpdesk": "Years of solo development have made me a self-sufficient troubleshooter across software, hardware, and systems. When something breaks, I diagnose and fix it. I have hands-on experience with remote support tools like TeamViewer and Remote Desktop, and my background explaining complex technical concepts to non-technical audiences (7 years in automotive finance, 5 years in admissions) means I can communicate clearly with end users while resolving their issues efficiently."
    }
  },

  "metadata": {
    "last_updated": "2026-01-21",
    "tone_guidelines": {
      "style": "inviting, focused, considerate, supportive, influential",
      "language": "relatable language most adults can easily understand",
      "avoid": ["jargon without context", "generic statements", "negative comments", "over-explanation", "em dashes", "overuse of I"]
    },
    "career_narrative": {
      "theme": "Over 25 years working with technology in business environments",
      "progression": "Army paramedic (5 years) → Toyota (7 years, 3 roles) → Full-stack developer (2023-present)",
      "learning_journey": "Self-teaching web technologies since the early 2000s, formalized at Full Sail (2016-2017), self-directed study while at Toyota (2017-2023), then full-time development (2023-present)",
      "key_message": "Same commitment that earned promotions and kept patients alive now drives software development"
    },
    "current_interests": [
      "Full-time developer roles",
      "Contract work",
      "Consulting engagements"
    ],
    "hobbies": {
      "bjj": {
        "activity": "Brazilian Jiu-Jitsu",
        "current_rank": "Purple belt",
        "status": "Actively training at 48 years old",
        "history": {
          "2023": "Blue belt",
          "2024": "Purple belt"
        }
      },
      "racquetball": {
        "activity": "Racquetball",
        "status": "Retired",
        "level": "Mid-level recreational",
        "timeframe": "Twenties (during Army)"
      }
    }
  },

  "resume_variants": {
    "dev": {
      "title": "Full-Stack Developer",
      "output_file": "resume-dev.html",
      "summary_paragraphs": [
        "Over 25 years working with technology in business environments, shipping production software since 2023. I design systems that work, from AI automation to scalable architectures. The engineers I respect most never stop sharpening their tools, and neither do I.",
        "Before tech, I led a five-person medic team in the Army and earned three promotions at Toyota over seven years.",
        "What's stayed consistent: I stay calm when things break, I explain technical stuff so it makes sense the first time, and I follow through on what I say I'll do."
      ],
      "skills_display": [
        { "key": "frontend_ui" },
        { "key": "backend_data" },
        { "key": "testing_quality" },
        { "key": "ai_automation", "items_override": ["LLM Integration (OpenAI, Claude)", "Prompt Engineering", "RAG Systems", "Chatbots", "Vector Embeddings"] },
        { "key": "architecture" },
        { "key": "design_process" }
      ],
      "experience": [
        {
          "id": "needthisdone",
          "title_override": "Full-Stack Developer & Consultant",
          "company_override": "needthisdone.com",
          "description_override": "Independent Consulting Practice",
          "show_client_engagements": true
        },
        {
          "id": "toyota",
          "page_break": true,
          "title_override": "Finance and Insurance Manager",
          "description_override": "Salesperson → Sales Manager → F&I Manager"
        },
        {
          "id": "fullsail_work",
          "title_override": "Military Enrollment Counselor",
          "description_override": "International Admissions → Military Student Services"
        },
        {
          "id": "army",
          "title_override": "Combat Medic, Corporal (E-4)",
          "description_override": "Fort Hood, TX & Fort Bragg, NC"
        }
      ],
      "featured_projects": [
        {
          "id": "needthisdone",
          "role_override": "Live at needthisdone.com",
          "bullets": [
            "Full-stack Next.js application serving real customers in production",
            "Designed PostgreSQL database schema for users, products, orders, and payments",
            "Type-safe TypeScript throughout with Zod validation on API boundaries for data accuracy",
            "Admin dashboard for business operations and order management",
            "Stripe payment integration with secure checkout flows",
            "Ship reliably with Playwright E2E tests, Vitest unit tests, and CI/CD",
            "Built data validation pipelines ensuring accuracy before persistence"
          ],
          "technologies_override": ["React/Next.js", "TypeScript", "Medusa (Headless Commerce)", "PostgreSQL/Supabase", "Redis", "Stripe", "Playwright", "Vercel"]
        }
      ],
      "education": [
        {
          "school": "Full Sail University",
          "dates": "2016 - 2017",
          "description": "Web Design & Development coursework. After teaching myself web technologies since the early 2000s, this program provided the structure to take those skills to a professional level. Straight A's while working full-time."
        },
        {
          "school": "Independent Study",
          "dates": "2016 - 2023",
          "description": "Seven years of consistent skill development while working full-time. Progressed from tutorials to building production applications."
        },
        {
          "school": "Structured Coursework",
          "dates": "2023 - Present",
          "description": "freeCodeCamp Responsive Web Design Certification, freeCodeCamp Full Stack Developer Certification (in progress), Khan Academy CS Principles (100% mastery), Vue.js Complete Guide, 100 Days of Code."
        },
        {
          "school": "U.S. Army Medical Department Center & School",
          "dates": "1996 - 2001",
          "description": "Combat Medic certification. Graduated top 10% of class."
        }
      ],
      "influences": [
        {
          "title": "The Pragmatic Programmer",
          "author": "David Thomas & Andrew Hunt",
          "impact": "Why I fix the small stuff before it becomes big stuff. Broken windows invite more broken windows."
        },
        {
          "title": "Algorithms to Live By",
          "author": "Brian Christian & Tom Griffiths",
          "impact": "Sometimes good enough now beats perfect later. Knowing when to stop optimizing is its own skill."
        },
        {
          "title": "Never Split the Difference",
          "author": "Chris Voss",
          "impact": "Hard conversations get easier when you stop trying to win and start trying to understand."
        },
        {
          "title": "Seven Principles for Making Marriage Work",
          "author": "John Gottman",
          "impact": "What keeps marriages together keeps teams together: fix things fast, assume good intent, stay curious about the people you work with."
        }
      ]
    },

    "sales": {
      "title": "Sales & Customer Success Professional",
      "output_file": "resume-sales.html",
      "summary_paragraphs": [
        "Thirteen years helping people make decisions they feel good about. Seven years at Toyota, three promotions, and thousands of customers who left knowing exactly what they were getting. Five years guiding veterans and international students through one of the biggest choices of their lives.",
        "Before that, I was an Army medic. Leading a team in high-stakes situations taught me to stay calm, listen carefully, and communicate so people actually understand.",
        "I connect with people quickly, explain things in plain language, and do what I say I'm going to do. That's what I've built my career on."
      ],
      "skills_display": [
        {
          "label": "Sales & Revenue",
          "items": ["Consultative Selling", "Needs Assessment", "Objection Handling", "Closing Techniques", "Pipeline Management", "CRM Systems", "Upselling & Cross-selling"]
        },
        {
          "label": "Customer Success",
          "items": ["Account Management", "Relationship Building", "Problem Resolution", "Client Retention", "Onboarding", "Escalation Management", "Customer Advocacy"]
        },
        {
          "label": "Communication",
          "items": ["Complex Concept Translation", "Active Listening", "Written Communication", "Presentation Skills", "Conflict Resolution", "Cross-functional Collaboration"]
        },
        {
          "label": "Technical Proficiency",
          "items": ["CRM Platforms", "Microsoft Office Suite", "Remote Support Tools", "Data Entry & Management", "Basic Troubleshooting", "Documentation"]
        },
        {
          "label": "Finance & Compliance",
          "items": ["F&I Product Knowledge", "Lending Guidelines", "Regulatory Compliance", "Deal Structuring", "Contract Processing"]
        },
        {
          "label": "Leadership",
          "items": ["Team Mentoring", "Process Improvement", "Training Development", "Performance Under Pressure", "Decision Making"]
        }
      ],
      "experience": [
        {
          "id": "toyota",
          "title_override": "Finance & Insurance Manager",
          "description_override": "Salesperson → Sales Manager → F&I Manager (3 promotions)",
          "bullets_override": [
            "Earned three promotions over seven years at a high-volume dealership processing 10-30 deals daily",
            "Managed 3-7 customer transactions daily, presenting protection products and structuring financing across multiple lenders",
            "Built trust by explaining options clearly instead of pushing products. Customers left confident in their decisions",
            "Became the go-to person for complicated deals. Teammates brought me their toughest customers because I found solutions",
            "Maintained compliance with lending regulations while keeping transactions moving smoothly"
          ]
        },
        {
          "id": "fullsail_work",
          "title_override": "Admissions Representative & Military Liaison",
          "description_override": "International Admissions → Military Student Services",
          "bullets_override": [
            "Started in International Admissions helping prospective students from around the world navigate enrollment",
            "Moved to Military Student Services where my Army background gave me credibility with veterans",
            "Guided service members and families through GI Bill benefits, program costs, and fitting education around military schedules",
            "Consistently met enrollment goals through honest guidance rather than high-pressure tactics"
          ]
        },
        {
          "id": "quill",
          "title_override": "B2B Sales Representative",
          "description_override": "Office Supplies (Staples subsidiary)"
        },
        {
          "id": "army",
          "page_break": true,
          "title_override": "Combat Medic, Corporal (E-4)",
          "description_override": "Fort Hood, TX & Fort Bragg, NC",
          "bullets_override": [
            "Led a team of 3 medics and 2 combat lifesavers in high-pressure environments",
            "Delivered emergency care where staying calm and communicating clearly were critical",
            "Learned to follow protocols precisely while adapting to changing situations",
            "Built foundation of discipline and accountability that shows up in everything since"
          ]
        }
      ],
      "featured_projects": [],
      "education": [
        {
          "school": "Full Sail University",
          "dates": "2016 - 2017",
          "description": "Web Design & Development coursework. Earned A's in every class while working full-time, demonstrating the same work ethic I bring to every role."
        },
        {
          "school": "U.S. Army Medical Department Center & School",
          "dates": "1996 - 2001",
          "description": "Combat Medic certification. Graduated top 10% of class. Training emphasized decision-making under pressure and clear communication."
        }
      ],
      "influences": [
        {
          "title": "How to Win Friends and Influence People",
          "author": "Dale Carnegie",
          "impact": "The foundation of how I approach every customer interaction. Understanding people's needs before offering solutions isn't just good practice, it's respect."
        },
        {
          "title": "Never Split the Difference",
          "author": "Chris Voss",
          "impact": "Changed how I handle objections and difficult conversations. Tactical empathy isn't manipulation. It's genuinely trying to understand the other person's perspective."
        }
      ]
    }
  }
}
